{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "Hola",
                "¿Cómo estás?",
                "Buenos días",
                "¡Hola!",
                "¡Qué tal!",
                "Buenas tardes",
                "Buenas noches",
                "Hey",
                "¿Qué onda?",
                "Saludos"
            ],
            "responses": [
                "¡Hola! ¿Cómo puedo ayudarte?",
                "¡Hola! ¿En qué puedo ayudarte hoy?",
                "¡Saludos! ¿Qué necesitas?",
                "¡Hey! ¿Cómo estás?",
                "¡Qué gusto verte!"
            ]
        },
        {
            "tag": "despedida",
            "patterns": [
                "Adiós",
                "Hasta luego",
                "Nos vemos",
                "Hasta pronto",
                "Chao",
                "Me tengo que ir",
                "Nos vemos después",
                "Bye",
                "Hasta la vista",
                "Cuídate"
            ],
            "responses": [
                "¡Hasta luego! Que tengas un buen día.",
                "¡Adiós! ¡Vuelve pronto!",
                "¡Nos vemos! No dudes en preguntar cuando lo necesites.",
                "¡Cuídate!",
                "Bye, hasta la próxima."
            ]
        },
        {
            "tag": "agradecimientos",
            "patterns": [
                "gracias",
                "muchas gracias",
                "mil gracias",
                "muy amable",
                "se lo agradezco",
                "fue de ayuda",
                "gracias por la ayuda",
                "muy agradecido",
                "gracias por su tiempo",
                "gracias por responder"
            ],
            "responses": [
                "De nada, estoy aquí para ayudar.",
                "Feliz por ayudar.",
                "Gracias a ti por preguntar.",
                "¡Siempre a la orden!",
                "Fue un placer ayudarte."
            ]
        },
        {
            "tag": "celulares_para_juegos",
            "patterns": [
                "jugar",
                "gaming",
                "potente para juegos",
                "rendimiento en juegos",
                "jugar",
                "Teléfonos gaming",
                "Me gustan los juegos",
                "para jugar",
                "buena GPU",
                "mejor celular gamer"
            ],
            "responses": [
                "Para gaming, te recomiendo un celular con un buen procesador y al menos 8GB de RAM.",
                "Los teléfonos con Snapdragon 8 Gen 2 y buena tasa de refresco son ideales para juegos.",
                "Busca un celular con una GPU potente y refrigeración eficiente.",
                "Algunos celulares gaming incluyen botones físicos y triggers.",
                "¿Tienes un presupuesto en mente? Puedo recomendarte algo según tu rango de precio."
            ]
        },
        {
            "tag": "cámara_y_fotografía",
            "patterns": [
                "buena cámara",
                "tomar fotos",
                "cámara de alta calidad",
                "mejor cámara",
                "fotografía",
                "fotos profesionales",
                "buen zoom",
                "cámara nocturna",
                "estabilización óptica",
                "cámara frontal"
            ],
            "responses": [
                "Para fotografía, te sugiero un celular con al menos 50MP en la cámara principal y buen procesamiento de imagen.",
                "Los celulares de gama alta suelen tener mejores cámaras, pero hay opciones más accesibles con buenas prestaciones.",
                "Busca un celular con estabilización óptica para mejores fotos en movimiento.",
                "Algunos modelos cuentan con teleobjetivo para capturas a larga distancia.",
                "¿Prefieres un celular con cámara profesional o algo más equilibrado?"
            ]
        },
        {
            "tag": "resistencia_y_durabilidad",
            "patterns": [
                "resistente",
                "no se rompa fácil",
                "aguante golpes",
                "certificación IP68",
                "resistente al agua",
                "a prueba de polvo",
                "todoterreno",
                "reforzado",
                "Gorilla Glass"
            ],
            "responses": [
                "Si buscas un celular resistente, te recomiendo modelos con certificación IP68 o con protección militar.",
                "Algunos celulares como los CAT o Samsung XCover están diseñados para resistir golpes y polvo.",
                "Los celulares con Gorilla Glass suelen tener pantallas más resistentes.",
                "Si trabajas en ambientes exigentes, te sugiero un smartphone todoterreno."
            ]
        },
        {
            "tag": "trabajo_y_productividad",
            "patterns": [
                "trabajo",
                "negocios",
                "multitarea",
                "S Pen",
                "almacenamiento",
                "ápido",
                "videollamadas",
                "productividad",
                "Microsoft Office",
                "batería"
            ],
            "responses": [
                "Si buscas un celular para trabajo, te sugiero modelos con buena batería y almacenamiento amplio.",
                "Algunos modelos premium incluyen funciones específicas para productividad como Samsung Dex o Apple Continuity.",
                "Si necesitas tomar notas, te recomiendo un celular con lápiz óptico como la serie Galaxy Note o S Ultra.",
                "¿Buscas algo potente o más enfocado en batería y conectividad?"
            ]
        },
        {
            "tag": "software_y_actualizaciones",
            "patterns": [
                "soporte de actualizaciones",
                "soporte de software",
                "seguridad actualizada",
                "Android 15",
                "Actualizacion"
            ],
            "responses": [
                "Si buscas un celular con actualizaciones garantizadas, los Google Pixel y Samsung tienen buen soporte.",
                "Apple ofrece soporte de software por más años que la mayoría de marcas de Android.",
                "Si te preocupa la seguridad, busca celulares con parches de seguridad mensuales.",
                "Los celulares con Android puro suelen recibir actualizaciones más rápido que los personalizados."
            ]
        },
        {
            "tag": "celulares_por_marca",
            "patterns": [
                "Samsung",
                "Apple",
                "Xiaomi",
                "Motorola",
                "Realme",
                "Huawei",
                "Google Pixel",
                "OnePlus",
                "Asus",
                "Sony"
            ],
            "responses": [
                "Claro, aquí tienes modelos de la marca que buscas.",
                "Estos son algunos de los mejores celulares de esa marca.",
                "Déjame filtrar los modelos disponibles de esa marca.",
                "Los celulares de esta marca tienen diferentes opciones, ¿buscas algo en específico?",
                "Puedo mostrarte los últimos lanzamientos o modelos populares de esa marca."
            ]
        },
        {
            "tag": "pantalla_y_calidad",
            "patterns": [
                "pantalla",
                "AMOLED",
                "Hercios",
                "Hz",
                "pulgadas",
                "OLED",
                "HDR10",
                "resolución",
            ],
            "responses": [
                "Si buscas una pantalla grande, te recomendaría un modelo con más de 6.5 pulgadas.",
                "Las pantallas AMOLED ofrecen mejor contraste y colores más vivos.",
                "Los celulares con 120Hz ofrecen una experiencia más fluida al navegar y jugar.",
                "Si quieres la mejor calidad de pantalla, busca modelos con HDR10 o Dolby Vision.",
                "¿Te interesa más la calidad de imagen o el tamaño de la pantalla?"
            ]
        },
        {
            "tag": "celulares_nuevos_y_antiguos",
            "patterns": [
                "nuevo",
                "este año",
                "reciente",
                "última generación"
            ],
            "responses": [
                "Aquí tienes una lista de los celulares más recientes.",
                "Estos son algunos modelos lanzados en los últimos meses.",
                "Si buscas lo último en tecnología, estos celulares pueden interesarte.",
                "¿Te gustaría un modelo de gama alta o prefieres algo más asequible?",
                "Déjame buscar los modelos más recientes en nuestra base de datos."
            ]
        }
    ]
}